# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-eid'
tap 'homebrew/case-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # `cat` on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'httpie' # Super useful for testing HTTP Requests
brew 'gh' # GitHub CLI https://cli.github.com/
brwe 'mackup' # Mac backups
brew 'mas' # Mac App Store Manager - a CLI way to install Mac Apps
brew 'pkg-config'
brew 'rectangle' # Window resize and positioning tool
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'trash' # Manage the trash bin
brew 'tree' # List directories in a tree like structure
brew 'zsh'
brew 'zsh-completions'

# Development Specific
brew 'composer'
brew 'imagemagick'
brew 'php'
brew 'mysql'
brew 'nvm'
brew 'redis'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Apps
cask 'aerial'
cask 'figma'
cask 'discord'
cask 'docker'
cask 'imageoptim'
cask 'insomnia'
cask 'github' # GitHub GUI
cask 'google-chrome'
cask 'google-drive-file-stream' # Google Drive File Stream, for mackup and GDrive usage
cask 'gpg-suite' # For creating and managing GPG Keys
cask 'phpmon'
cask 'raycast'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'tuple'
cask 'visual-studio-code'
cask 'warp'
cask 'whatsapp'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
